while-one/caffeine-hal-ports/src/stm32/stm32f4/cfn_hal_uart_port.c
/**
 * Copyright (c) 2026 Hisham Moussa Daou <https://www.whileone.me>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 *
 * @file cfn_hal_uart_port.c
 * @brief STM32F4 UART HAL Port Implementation
 */

/* Includes ---------------------------------------------------------*/
#include "cfn_hal_uart_port.h"
#include "cfn_hal_clock.h"
#include "cfn_hal_clock_port.h"
#include "cfn_hal_dma.h"
#include "cfn_hal_dma_port.h"
#include "cfn_hal_gpio.h"
#include "cfn_hal_stm32_error.h"
#include "cfn_hal_uart.h"
#include "stm32f4xx_hal.h"

/* Private Prototypes ----------------------------------------------*/
/* Private Prototypes ----------------------------------------------*/
#ifdef HAL_UART_MODULE_ENABLED

/* Private Data -----------------------------------------------------*/

/**
 * @brief Mapping from Caffeine UART data length configuration to STM32 HAL
 * WordLength.
 */
static const uint32_t PORT_MAP_DATA_LEN[CFN_HAL_UART_CONFIG_DATA_LEN_MAX] = {
    [CFN_HAL_UART_CONFIG_DATA_LEN_5] = UINT32_MAX,         // Not supported
    [CFN_HAL_UART_CONFIG_DATA_LEN_6] = UINT32_MAX,         // Not supported
    [CFN_HAL_UART_CONFIG_DATA_LEN_7] = UINT32_MAX,         // Not supported
    [CFN_HAL_UART_CONFIG_DATA_LEN_8] = UART_WORDLENGTH_8B, // 8 bits
    [CFN_HAL_UART_CONFIG_DATA_LEN_9] = UART_WORDLENGTH_9B, // 9 bits
};

/**
 * @brief Mapping from Caffeine UART stop bits configuration to STM32 HAL
 * StopBits.
 */
static const uint32_t PORT_MAP_STOP_BITS[CFN_HAL_UART_CONFIG_STOP_MAX] = {
    [CFN_HAL_UART_CONFIG_STOP_ONE_BIT]  = UART_STOPBITS_1,
    [CFN_HAL_UART_CONFIG_STOP_TWO_BITS] = UART_STOPBITS_2,
};

/**
 * @brief Mapping from Caffeine UART parity configuration to STM32 HAL Parity.
 */
static const uint32_t PORT_MAP_PARITY[CFN_HAL_UART_CONFIG_PARITY_MAX] = {
    [CFN_HAL_UART_CONFIG_PARITY_NONE] = UART_PARITY_NONE,
    [CFN_HAL_UART_CONFIG_PARITY_EVEN] = UART_PARITY_EVEN,
    [CFN_HAL_UART_CONFIG_PARITY_ODD]  = UART_PARITY_ODD,
};

/**
 * @brief Mapping from Caffeine UART direction configuration to STM32 HAL Mode.
 */
static const uint32_t PORT_MAP_DIRECTION[CFN_HAL_UART_CONFIG_DIRECTION_MAX] = {
    [CFN_HAL_UART_CONFIG_DIRECTION_NONE]    = 0,
    [CFN_HAL_UART_CONFIG_DIRECTION_TX_ONLY] = UART_MODE_TX,
    [CFN_HAL_UART_CONFIG_DIRECTION_RX_ONLY] = UART_MODE_RX,
    [CFN_HAL_UART_CONFIG_DIRECTION_TX_RX]   = UART_MODE_TX_RX,
};

/**
 * @brief Mapping from Caffeine UART flow control configuration to STM32 HAL
 * HwFlowCtl.
 */
static const uint32_t PORT_MAP_FLOW_CONTROL[CFN_HAL_UART_CONFIG_FLOW_CTRL_MAX] = {
    [CFN_HAL_UART_CONFIG_FLOW_CTRL_NONE]    = UART_HWCONTROL_NONE,
    [CFN_HAL_UART_CONFIG_FLOW_CTRL_CTS]     = UART_HWCONTROL_CTS,
    [CFN_HAL_UART_CONFIG_FLOW_CTRL_RTS]     = UART_HWCONTROL_RTS,
    [CFN_HAL_UART_CONFIG_FLOW_CTRL_RTS_CTS] = UART_HWCONTROL_RTS_CTS,
};

/**
 * @brief Table of physical peripheral register base addresses.
 */
static USART_TypeDef *const PORT_INSTANCES[CFN_HAL_UART_PORT_MAX] = {
#if defined(USART1)
    [CFN_HAL_UART_PORT_USART1] = USART1,
#endif
#if defined(USART2)
    [CFN_HAL_UART_PORT_USART2] = USART2,
#endif
#if defined(USART3)
    [CFN_HAL_UART_PORT_USART3] = USART3,
#endif
#if defined(UART4)
    [CFN_HAL_UART_PORT_UART4] = UART4,
#endif
#if defined(UART5)
    [CFN_HAL_UART_PORT_UART5] = UART5,
#endif
#if defined(USART6)
    [CFN_HAL_UART_PORT_USART6] = USART6,
#endif
#if defined(UART7)
    [CFN_HAL_UART_PORT_UART7] = UART7,
#endif
#if defined(UART8)
    [CFN_HAL_UART_PORT_UART8] = UART8,
#endif
#if defined(UART9)
    [CFN_HAL_UART_PORT_UART9] = UART9,
#endif
#if defined(UART10)
    [CFN_HAL_UART_PORT_UART10] = UART10,
#endif
};

static const uint32_t PORT_MAP_PERIPHERAL_ID[CFN_HAL_UART_PORT_MAX] = {
#if defined(USART1)
    [CFN_HAL_UART_PORT_USART1] = CFN_HAL_PORT_PERIPH_USART1,
#endif
#if defined(USART2)
    [CFN_HAL_UART_PORT_USART2] = CFN_HAL_PORT_PERIPH_USART2,
#endif
#if defined(USART3)
    [CFN_HAL_UART_PORT_USART3] = CFN_HAL_PORT_PERIPH_USART3,
#endif
#if defined(UART4)
    [CFN_HAL_UART_PORT_UART4] = CFN_HAL_PORT_PERIPH_UART4,
#endif
#if defined(UART5)
    [CFN_HAL_UART_PORT_UART5] = CFN_HAL_PORT_PERIPH_UART5,
#endif
#if defined(USART6)
    [CFN_HAL_UART_PORT_USART6] = CFN_HAL_PORT_PERIPH_USART6,
#endif
#if defined(UART7)
    [CFN_HAL_UART_PORT_UART7] = CFN_HAL_PORT_PERIPH_UART7,
#endif
#if defined(UART8)
    [CFN_HAL_UART_PORT_UART8] = CFN_HAL_PORT_PERIPH_UART8,
#endif
#if defined(UART9)
    [CFN_HAL_UART_PORT_UART9] = CFN_HAL_PORT_PERIPH_UART9,
#endif
#if defined(UART10)
    [CFN_HAL_UART_PORT_UART10] = CFN_HAL_PORT_PERIPH_UART10,
#endif
};

/**
 * @brief Array of STM32 HAL UART handles, one for each physical port.
 */
static UART_HandleTypeDef port_huarts[CFN_HAL_UART_PORT_MAX];

/**
 * @brief Array of active Caffeine UART driver pointers, used by ISRs and
 * callbacks.
 */
static cfn_hal_uart_t *port_drivers[CFN_HAL_UART_PORT_MAX];

/* Internal Helpers -------------------------------------------------*/

/**
 * @brief Calculates the port ID from an STM32 HAL UART handle pointer using
 * O(1) arithmetic.
 * @param huart Pointer to the STM32 HAL UART handle.
 * @return The 0-based port ID, or UINT32_MAX if the handle is not part of the
 * port array.
 */
static uint32_t get_port_id_from_handle(UART_HandleTypeDef *huart)
{
    if (!huart)
    {
        return UINT32_MAX;
    }
    if ((huart < &port_huarts[0]) || (huart >= &port_huarts[CFN_HAL_UART_PORT_MAX]))
    {
        return UINT32_MAX;
    }
    return (uint32_t) (huart - port_huarts);
}

/* VMT Implementations ----------------------------------------------*/

/**
 * @brief Performs low-level hardware initialization (Clocks and GPIOs).
 * @param driver Pointer to the UART driver instance.
 */
static cfn_hal_error_code_t low_level_init(cfn_hal_uart_t *driver)
{
    if (driver == NULL || driver->phy == NULL)
    {
        return CFN_HAL_ERROR_BAD_PARAM;
    }

    struct cfn_hal_clock_s *clk = driver->base.clock_driver;
    if (clk == NULL)
    {
        return CFN_HAL_ERROR_BAD_PARAM;
    }
    uint32_t port_id = (uint32_t) (uintptr_t) driver->phy->instance;

    if (port_id >= CFN_HAL_UART_PORT_MAX)
    {
        return CFN_HAL_ERROR_BAD_PARAM;
    }

