while-one/caffeine-hal-ports/src/stm32/stm32f4/cfn_hal_uart_port.c
    cfn_hal_clock_enable_gate((cfn_hal_clock_t *) clk, driver->base.peripheral_id);

    if (driver->phy->tx)
    {
        (void) cfn_hal_gpio_init(driver->phy->tx->port);
    }
    if (driver->phy->rx)
    {
        (void) cfn_hal_gpio_init(driver->phy->rx->port);
    }

    /* DMA Dependency Linking */
    if (driver->base.dependency != NULL)
    {
        cfn_hal_dma_t     **dma_deps = (cfn_hal_dma_t **) driver->base.dependency;
        UART_HandleTypeDef *huart    = &port_huarts[port_id];

        if (dma_deps[0] != NULL)
        {
            uint32_t tx_dma_port_id = (uint32_t) (uintptr_t) dma_deps[0]->phy->instance;
            __HAL_LINKDMA(huart, hdmatx, port_hdmas[tx_dma_port_id]);
        }
        if (dma_deps[1] != NULL)
        {
            uint32_t rx_dma_port_id = (uint32_t) (uintptr_t) dma_deps[1]->phy->instance;
            __HAL_LINKDMA(huart, hdmarx, port_hdmas[rx_dma_port_id]);
        }
    }

    return CFN_HAL_ERROR_OK;
}

/**
 * @brief Base initialization for the STM32 UART peripheral.
 * @param base Pointer to the base driver structure.
 * @return CFN_HAL_ERROR_OK on success, or a specific error code on failure.
 */
static cfn_hal_error_code_t port_base_init(cfn_hal_driver_t *base)
{
    if (base == NULL)
    {
        return CFN_HAL_ERROR_BAD_PARAM;
    }
    cfn_hal_uart_t     *driver  = (cfn_hal_uart_t *) base;
    uint32_t            port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    UART_HandleTypeDef *huart   = &port_huarts[port_id];

    cfn_hal_error_code_t error  = low_level_init(driver);

    if (error != CFN_HAL_ERROR_OK)
    {
        return error;
    }

    huart->Instance          = PORT_INSTANCES[port_id];
    huart->Init.BaudRate     = driver->config->baudrate;
    huart->Init.WordLength   = PORT_MAP_DATA_LEN[driver->config->data_len];
    huart->Init.StopBits     = PORT_MAP_STOP_BITS[driver->config->stop_bits];
    huart->Init.Parity       = PORT_MAP_PARITY[driver->config->parity];
    huart->Init.Mode         = PORT_MAP_DIRECTION[driver->config->direction];
    huart->Init.HwFlowCtl    = PORT_MAP_FLOW_CONTROL[driver->config->flow_ctrl];
    huart->Init.OverSampling = UART_OVERSAMPLING_16;

    return cfn_hal_stm32_map_error(HAL_UART_Init(huart));
}

/**
 * @brief Base deinitialization for the STM32 UART peripheral.
 * @param base Pointer to the base driver structure.
 * @return CFN_HAL_ERROR_OK on success, or a specific error code on failure.
 */
static cfn_hal_error_code_t port_base_deinit(cfn_hal_driver_t *base)
{
    cfn_hal_uart_t *driver  = (cfn_hal_uart_t *) base;
    uint32_t        port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    return cfn_hal_stm32_map_error(HAL_UART_DeInit(&port_huarts[port_id]));
}

/**
 * @brief Updates the UART configuration at runtime.
 * @param base Pointer to the base driver structure.
 * @param config Pointer to the new UART configuration structure.
 * @return CFN_HAL_ERROR_OK on success, or a specific error code on failure.
 */
static cfn_hal_error_code_t port_base_config_set(cfn_hal_driver_t *base, const void *config)
{
    CFN_HAL_UNUSED(base);
    CFN_HAL_UNUSED(config);
    return port_base_init(base);
}

/**
 * @brief Enables specific UART interrupt events.
 * @param base Pointer to the base driver structure.
 * @param event_mask Bitmask of nominal events to enable.
 * @return CFN_HAL_ERROR_OK on success.
 */
static cfn_hal_error_code_t port_base_event_enable(cfn_hal_driver_t *base, uint32_t event_mask)
{
    cfn_hal_uart_t     *driver  = (cfn_hal_uart_t *) base;
    uint32_t            port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    UART_HandleTypeDef *huart   = &port_huarts[port_id];

    if (event_mask & (uint32_t) CFN_HAL_UART_EVENT_RX_READY)
    {
        __HAL_UART_ENABLE_IT(huart, UART_IT_RXNE);
    }
    if (event_mask & (uint32_t) CFN_HAL_UART_EVENT_TX_COMPLETE)
    {
        __HAL_UART_ENABLE_IT(huart, UART_IT_TC);
    }
    if (event_mask & (uint32_t) CFN_HAL_UART_EVENT_BUS_IDLE)
    {
        __HAL_UART_ENABLE_IT(huart, UART_IT_IDLE);
    }

    return CFN_HAL_ERROR_OK;
}

/**
 * @brief Disables specific UART interrupt events.
 * @param base Pointer to the base driver structure.
 * @param event_mask Bitmask of nominal events to disable.
 * @return CFN_HAL_ERROR_OK on success.
 */
static cfn_hal_error_code_t port_base_event_disable(cfn_hal_driver_t *base, uint32_t event_mask)
{
    cfn_hal_uart_t     *driver  = (cfn_hal_uart_t *) base;
    uint32_t            port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    UART_HandleTypeDef *huart   = &port_huarts[port_id];

    if (event_mask & (uint32_t) CFN_HAL_UART_EVENT_RX_READY)
    {
        __HAL_UART_DISABLE_IT(huart, UART_IT_RXNE);
    }
    if (event_mask & (uint32_t) CFN_HAL_UART_EVENT_TX_COMPLETE)
    {
        __HAL_UART_DISABLE_IT(huart, UART_IT_TC);
    }
    if (event_mask & (uint32_t) CFN_HAL_UART_EVENT_BUS_IDLE)
    {
        __HAL_UART_DISABLE_IT(huart, UART_IT_IDLE);
    }

    return CFN_HAL_ERROR_OK;
}

/**
 * @brief Gets the current status of UART interrupt flags.
 * @param base Pointer to the base driver structure.
 * @param event_mask Pointer to store the bitmask of active events.
 * @return CFN_HAL_ERROR_OK on success.
 */
static cfn_hal_error_code_t port_base_event_get(cfn_hal_driver_t *base, uint32_t *event_mask)
{
    cfn_hal_uart_t     *driver  = (cfn_hal_uart_t *) base;
    uint32_t            port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    UART_HandleTypeDef *huart   = &port_huarts[port_id];
    uint32_t            mask    = 0;

    if (__HAL_UART_GET_FLAG(huart, UART_FLAG_RXNE))
    {
        mask |= (uint32_t) CFN_HAL_UART_EVENT_RX_READY;
    }
    if (__HAL_UART_GET_FLAG(huart, UART_FLAG_TC))
    {
        mask |= (uint32_t) CFN_HAL_UART_EVENT_TX_COMPLETE;
    }
    if (__HAL_UART_GET_FLAG(huart, UART_FLAG_IDLE))
    {
        mask |= (uint32_t) CFN_HAL_UART_EVENT_BUS_IDLE;
    }

    if (event_mask != NULL)
    {
        *event_mask = mask;
    }
    return CFN_HAL_ERROR_OK;
}

/**
 * @brief Enables specific UART exception error interrupts.
 * @param base Pointer to the base driver structure.
 * @param error_mask Bitmask of errors to enable.
 * @return CFN_HAL_ERROR_OK on success.
 */
static cfn_hal_error_code_t port_base_error_enable(cfn_hal_driver_t *base, uint32_t error_mask)
{
    cfn_hal_uart_t     *driver  = (cfn_hal_uart_t *) base;
    uint32_t            port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    UART_HandleTypeDef *huart   = &port_huarts[port_id];

    if (error_mask & (uint32_t) CFN_HAL_UART_ERROR_PARITY)
    {
        __HAL_UART_ENABLE_IT(huart, UART_IT_PE);
    }
    if (error_mask & ((uint32_t) CFN_HAL_UART_ERROR_FRAMING | (uint32_t) CFN_HAL_UART_ERROR_OVERRUN))
    {
        __HAL_UART_ENABLE_IT(huart, UART_IT_ERR);
    }

