while-one/caffeine-hal-ports/src/stm32/stm32f4/cfn_hal_uart_port.c
    return CFN_HAL_ERROR_OK;
}

/**
 * @brief Disables specific UART exception error interrupts.
 * @param base Pointer to the base driver structure.
 * @param error_mask Bitmask of errors to disable.
 * @return CFN_HAL_ERROR_OK on success.
 */
static cfn_hal_error_code_t port_base_error_disable(cfn_hal_driver_t *base, uint32_t error_mask)
{
    cfn_hal_uart_t     *driver  = (cfn_hal_uart_t *) base;
    uint32_t            port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    UART_HandleTypeDef *huart   = &port_huarts[port_id];

    if (error_mask & (uint32_t) CFN_HAL_UART_ERROR_PARITY)
    {
        __HAL_UART_DISABLE_IT(huart, UART_IT_PE);
    }
    if (error_mask & ((uint32_t) CFN_HAL_UART_ERROR_FRAMING | (uint32_t) CFN_HAL_UART_ERROR_OVERRUN))
    {
        __HAL_UART_DISABLE_IT(huart, UART_IT_ERR);
    }

    return CFN_HAL_ERROR_OK;
}

/**
 * @brief Gets the current status of UART error flags.
 * @param base Pointer to the base driver structure.
 * @param error_mask Pointer to store the bitmask of active errors.
 * @return CFN_HAL_ERROR_OK on success.
 */
static cfn_hal_error_code_t port_base_error_get(cfn_hal_driver_t *base, uint32_t *error_mask)
{
    cfn_hal_uart_t     *driver  = (cfn_hal_uart_t *) base;
    uint32_t            port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    UART_HandleTypeDef *huart   = &port_huarts[port_id];
    uint32_t            mask    = 0;

    if (__HAL_UART_GET_FLAG(huart, UART_FLAG_PE))
    {
        mask |= (uint32_t) CFN_HAL_UART_ERROR_PARITY;
    }
    if (__HAL_UART_GET_FLAG(huart, UART_FLAG_FE))
    {
        mask |= (uint32_t) CFN_HAL_UART_ERROR_FRAMING;
    }
    if (__HAL_UART_GET_FLAG(huart, UART_FLAG_ORE))
    {
        mask |= (uint32_t) CFN_HAL_UART_ERROR_OVERRUN;
    }

    if (error_mask != NULL)
    {
        *error_mask = mask;
    }
    return CFN_HAL_ERROR_OK;
}

/* ST HAL Callback Overrides ----------------------------------------*/

/**
 * @brief Override of the ST HAL Tx Complete callback to fire Caffeine events.
 * @param huart Pointer to the ST HAL UART handle.
 */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
    uint32_t port_id = get_port_id_from_handle(huart);
    if ((port_id != UINT32_MAX) && (port_drivers[port_id] != NULL))
    {
        cfn_hal_uart_t *driver = port_drivers[port_id];
        if (driver->cb != NULL)
        {
            driver->cb(driver, CFN_HAL_UART_EVENT_TX_COMPLETE, CFN_HAL_UART_ERROR_NONE, NULL, 0, driver->cb_user_arg);
        }
    }
}

/**
 * @brief Override of the ST HAL Rx Complete callback to fire Caffeine events.
 * @param huart Pointer to the ST HAL UART handle.
 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    uint32_t port_id = get_port_id_from_handle(huart);
    if ((port_id != UINT32_MAX) && (port_drivers[port_id] != NULL))
    {
        cfn_hal_uart_t *driver = port_drivers[port_id];
        if (driver->cb != NULL)
        {
            driver->cb(driver, CFN_HAL_UART_EVENT_RX_READY, CFN_HAL_UART_ERROR_NONE, NULL, 0, driver->cb_user_arg);
        }
    }
}

/**
 * @brief Override of the ST HAL Error callback to fire Caffeine events.
 * @param huart Pointer to the ST HAL UART handle.
 */
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    uint32_t port_id = get_port_id_from_handle(huart);
    if ((port_id != UINT32_MAX) && (port_drivers[port_id] != NULL))
    {
        cfn_hal_uart_t *driver = port_drivers[port_id];
        if (driver->cb != NULL)
        {
            uint32_t error_mask = 0;
            (void) port_base_error_get(&driver->base, &error_mask);
            driver->cb(driver, CFN_HAL_UART_EVENT_NONE, error_mask, NULL, 0, driver->cb_user_arg);
        }
    }
}

/**
 * @brief Override of the ST HAL Rx Event callback (Idle/Half-Full) to fire
 * Caffeine events.
 * @param huart Pointer to the ST HAL UART handle.
 * @param size Number of bytes received so far.
 */
void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t size)
{
    uint32_t port_id = get_port_id_from_handle(huart);
    if ((port_id != UINT32_MAX) && (port_drivers[port_id] != NULL))
    {
        cfn_hal_uart_t *driver = port_drivers[port_id];
        if (driver->cb != NULL)
        {
            /* Notify RX READY with the actual size received */
            driver->cb(
                driver, CFN_HAL_UART_EVENT_RX_READY, CFN_HAL_UART_ERROR_NONE, NULL, (size_t) size, driver->cb_user_arg);
        }
    }
}

/* Raw ISR Handlers -------------------------------------------------*/

#ifndef CFN_HAL_PORT_DISABLE_IRQ_UART
void UART4_IRQHandler(void);  // NOLINT(readability-identifier-naming)
void UART5_IRQHandler(void);  // NOLINT(readability-identifier-naming)
void USART1_IRQHandler(void); // NOLINT(readability-identifier-naming)
void USART2_IRQHandler(void); // NOLINT(readability-identifier-naming)
void USART3_IRQHandler(void); // NOLINT(readability-identifier-naming)
void USART6_IRQHandler(void); // NOLINT(readability-identifier-naming)

/**
 * @brief Unified internal ISR handler for all UART instances.
 * @param port_id The physical UART port ID.
 */
static void port_uart_handle_isr(cfn_hal_uart_port_t port_id)
{
    UART_HandleTypeDef *huart  = &port_huarts[port_id];
    cfn_hal_uart_t     *driver = port_drivers[port_id];

    if (driver != NULL && huart != NULL)
    {
        uint32_t isrflags = READ_REG(huart->Instance->SR);
        uint32_t cr1its   = READ_REG(huart->Instance->CR1);

        if ((driver->base.flags & CFN_HAL_UART_FLAG_CONTINUOUS_RX) && ((isrflags & USART_SR_RXNE) != RESET) &&
            ((cr1its & USART_CR1_RXNEIE) != RESET))
        {
            uint32_t error_mask = CFN_HAL_UART_ERROR_NONE;
            if (isrflags & USART_SR_ORE)
            {
                error_mask |= (uint32_t) CFN_HAL_UART_ERROR_OVERRUN;
            }
            if (isrflags & USART_SR_FE)
            {
                error_mask |= (uint32_t) CFN_HAL_UART_ERROR_FRAMING;
            }
            if (isrflags & USART_SR_NE)
            {
                error_mask |= (uint32_t) CFN_HAL_UART_ERROR_GENERAL;
            }
            if (isrflags & USART_SR_PE)
            {
                error_mask |= (uint32_t) CFN_HAL_UART_ERROR_PARITY;
            }

            /* Read DR to get byte and clear RXNE flag. */
#if defined(USART_SR_RXNE)
            uint8_t byte = (uint8_t) (huart->Instance->DR & (uint8_t) 0x00FF);
#else
            uint8_t byte = (uint8_t) (huart->Instance->RDR & (uint8_t) 0x00FF);
#endif
            if (driver->cb)
            {
                driver->cb(driver, CFN_HAL_UART_EVENT_RX_BYTE, error_mask, &byte, 1, driver->cb_user_arg);
            }
            /* Return early to avoid HAL overhead. Any concurrent interrupt sources
               (TXE, TC, etc.) will cause the NVIC to immediately re-trigger the ISR.
             */
            return;
        }
    }
    HAL_UART_IRQHandler(huart);
}

